In [2]:
import pandas as pd
import mysql.connector
import sqlite3 as sql

In [7]:
class Main:
    def __init__(self,username,host,password,database,query):
        self.username = username
        self.df = None
        self.query = query
        self.host = host
        self.password = password
        self.database = database
    def connection(self):
        conn = mysql.connector.connect(user = self.username,host = self.host,password = self.password,database = self.database)
        cur = conn.cursor()
        self.df = pd.read_sql_query(self.query,conn)
        return self.df
a = Main("root","127.0.0.1","ashu13579","library",input())
b = Main("root","127.0.0.1","ashu13579","library",input())
#a.connection()
df = a.connection()
df2 = b.connection()

 select * from employee
 select * from main

C:\Users\delli\AppData\Local\Temp\ipykernel_2656\389856086.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  self.df = pd.read_sql_query(self.query,conn)

In [8]:
df

   employeeID FirstName FamilyName          position   salary    HireDate
0         101      John        Doe  Junior Developer   6600.0  2020-03-15
1         102      Jane      Smith           Manager   8250.0  2019-06-01
2         103     Emily    Johnson  Junior Developer  60000.0  2018-11-22
3         106     David     Wilson  Junior Developer   6820.0  2021-05-25
4         107     Laura   Martinez           Manager  70000.0  2017-12-15
5         109      Lisa     Thomas  Junior Developer   5500.0  2020-09-10
6         110     Kevin     Taylor  Junior Developer   7040.0  2022-04-05
7          19  Ashutosh     Tiwari     Data Engineer  50000.0  2020-01-02

TypeError: read_sql_query() missing 1 required positional argument: 'con'